import numpy as np

"""
=========(y,x)============
(y,x)   (y,x)  (0,2)  (0,3)
(1,0)  (y,x)   (1,2)  (1,3)
(2,0)  (2,1)  (2,2)  (y,x)
(3,0)  (3,1)  (3,2)  (y,x)
(4,0)  (4,1)  (y,x)   (y,x)

=========(y,x)============
근데, 이게 맞게 된건가? (0,2) 의 세로 높이가 9200이나 된다고?

(0,2) ==> 세로: 9200    가로: 17900
(0,3) ==> 세로: 9200    가로: 23650

(1,0) ==> 세로: 13000   가로: 3150 
(1,2) ==> 세로: 13000   가로: 17900
(1,3) ==> 세로: 13000   가로: 23650

(2,0) ==> 세로: 16800   가로: 3150 
(2,1) ==> 세로: 16800   가로: 10350
(2,2) ==> 세로: 16800   가로: 17900

(3,0) ==> 세로: 20600   가로: 3150 
(3,1) ==> 세로: 20600   가로: 10350
(3,2) ==> 세로: 20600   가로: 17900

(4,0) ==> 세로: 24400   가로: 3150 
(4,1) ==> 세로: 24400   가로: 10350
(4,2) ==> 세로: 24400   가로: 17900

========================
왼쪽 상단이 원점
0         3150  10350  17900  23650 
9200                          
13000    
16800   
20600   
24400   
"""


def get_real_coord(y, x):
    """
        (y,x)를 입력으로 받고 (real_y, real_x)를 출력한다
        입력: y 좌표 먼저, x 는 그 다음이다
        리턴값: y 좌표 먼저, x 는 그 다음이다
    """

    max_y_index = 4
    max_x_index = 3

    if y < 0 or y > max_y_index:
        assert False, 'incorrect index of y'

    if x < 0 or x > max_x_index:
        assert False, 'incorrect index of x'

    if y == 0 and x == 2:
        return 9200, 17900

    if y == 0 and x == 3:
        return 9200, 23650

    if y == 1 and x == 0: 
        return 13000, 3150 

    if y == 1 and x == 2:
        return 13000, 17900

    if y == 1 and x == 3:
        return 13000, 23650

    if y == 2 and x == 0:
        return 16800, 3150 
    
    if y == 2 and x == 1:
        return 16800, 10350

    if y === 2 and x == 2: 
        return 16800, 17900

    if y == 3 and x == 0: 
        return 20600, 3150 

    if y == 3 and x == 1: 
        return 20600, 10350

    if y == 3 and x == 2: 
        return 20600, 17900

    if y == 4 and x == 0: 
        return 24400, 3150 

    if y == 4 and x == 1: 
        return 24400, 10350

    if y == 4 and x == 2: 
        return 24400, 17900        

    # 그 외의 경우
    return -1, -1

